GopalSaraf/Practicals/PSDL/include/proc/pic18f84j11.inc
// Register: LATH
#define LATH LATH
LATH                                     equ 0F90h
// bitfield definitions
LATH_LATH0_POSN                          equ 0000h
LATH_LATH0_POSITION                      equ 0000h
LATH_LATH0_SIZE                          equ 0001h
LATH_LATH0_LENGTH                        equ 0001h
LATH_LATH0_MASK                          equ 0001h
LATH_LATH1_POSN                          equ 0001h
LATH_LATH1_POSITION                      equ 0001h
LATH_LATH1_SIZE                          equ 0001h
LATH_LATH1_LENGTH                        equ 0001h
LATH_LATH1_MASK                          equ 0002h
LATH_LATH2_POSN                          equ 0002h
LATH_LATH2_POSITION                      equ 0002h
LATH_LATH2_SIZE                          equ 0001h
LATH_LATH2_LENGTH                        equ 0001h
LATH_LATH2_MASK                          equ 0004h
LATH_LATH3_POSN                          equ 0003h
LATH_LATH3_POSITION                      equ 0003h
LATH_LATH3_SIZE                          equ 0001h
LATH_LATH3_LENGTH                        equ 0001h
LATH_LATH3_MASK                          equ 0008h
LATH_LATH4_POSN                          equ 0004h
LATH_LATH4_POSITION                      equ 0004h
LATH_LATH4_SIZE                          equ 0001h
LATH_LATH4_LENGTH                        equ 0001h
LATH_LATH4_MASK                          equ 0010h
LATH_LATH5_POSN                          equ 0005h
LATH_LATH5_POSITION                      equ 0005h
LATH_LATH5_SIZE                          equ 0001h
LATH_LATH5_LENGTH                        equ 0001h
LATH_LATH5_MASK                          equ 0020h
LATH_LATH6_POSN                          equ 0006h
LATH_LATH6_POSITION                      equ 0006h
LATH_LATH6_SIZE                          equ 0001h
LATH_LATH6_LENGTH                        equ 0001h
LATH_LATH6_MASK                          equ 0040h
LATH_LATH7_POSN                          equ 0007h
LATH_LATH7_POSITION                      equ 0007h
LATH_LATH7_SIZE                          equ 0001h
LATH_LATH7_LENGTH                        equ 0001h
LATH_LATH7_MASK                          equ 0080h
LATH_LH0_POSN                            equ 0000h
LATH_LH0_POSITION                        equ 0000h
LATH_LH0_SIZE                            equ 0001h
LATH_LH0_LENGTH                          equ 0001h
LATH_LH0_MASK                            equ 0001h
LATH_LH1_POSN                            equ 0001h
LATH_LH1_POSITION                        equ 0001h
LATH_LH1_SIZE                            equ 0001h
LATH_LH1_LENGTH                          equ 0001h
LATH_LH1_MASK                            equ 0002h
LATH_LH2_POSN                            equ 0002h
LATH_LH2_POSITION                        equ 0002h
LATH_LH2_SIZE                            equ 0001h
LATH_LH2_LENGTH                          equ 0001h
LATH_LH2_MASK                            equ 0004h
LATH_LH3_POSN                            equ 0003h
LATH_LH3_POSITION                        equ 0003h
LATH_LH3_SIZE                            equ 0001h
LATH_LH3_LENGTH                          equ 0001h
LATH_LH3_MASK                            equ 0008h
LATH_LH4_POSN                            equ 0004h
LATH_LH4_POSITION                        equ 0004h
LATH_LH4_SIZE                            equ 0001h
LATH_LH4_LENGTH                          equ 0001h
LATH_LH4_MASK                            equ 0010h
LATH_LH5_POSN                            equ 0005h
LATH_LH5_POSITION                        equ 0005h
LATH_LH5_SIZE                            equ 0001h
LATH_LH5_LENGTH                          equ 0001h
LATH_LH5_MASK                            equ 0020h
LATH_LH6_POSN                            equ 0006h
LATH_LH6_POSITION                        equ 0006h
LATH_LH6_SIZE                            equ 0001h
LATH_LH6_LENGTH                          equ 0001h
LATH_LH6_MASK                            equ 0040h
LATH_LH7_POSN                            equ 0007h
LATH_LH7_POSITION                        equ 0007h
LATH_LH7_SIZE                            equ 0001h
LATH_LH7_LENGTH                          equ 0001h
LATH_LH7_MASK                            equ 0080h

// Register: LATJ
#define LATJ LATJ
LATJ                                     equ 0F91h
// bitfield definitions
LATJ_LATJ0_POSN                          equ 0000h
LATJ_LATJ0_POSITION                      equ 0000h
LATJ_LATJ0_SIZE                          equ 0001h
LATJ_LATJ0_LENGTH                        equ 0001h
LATJ_LATJ0_MASK                          equ 0001h
LATJ_LATJ1_POSN                          equ 0001h
LATJ_LATJ1_POSITION                      equ 0001h
LATJ_LATJ1_SIZE                          equ 0001h
LATJ_LATJ1_LENGTH                        equ 0001h
LATJ_LATJ1_MASK                          equ 0002h
LATJ_LATJ2_POSN                          equ 0002h
LATJ_LATJ2_POSITION                      equ 0002h
LATJ_LATJ2_SIZE                          equ 0001h
LATJ_LATJ2_LENGTH                        equ 0001h
LATJ_LATJ2_MASK                          equ 0004h
LATJ_LATJ3_POSN                          equ 0003h
LATJ_LATJ3_POSITION                      equ 0003h
LATJ_LATJ3_SIZE                          equ 0001h
LATJ_LATJ3_LENGTH                        equ 0001h
LATJ_LATJ3_MASK                          equ 0008h
LATJ_LATJ4_POSN                          equ 0004h
LATJ_LATJ4_POSITION                      equ 0004h
LATJ_LATJ4_SIZE                          equ 0001h
LATJ_LATJ4_LENGTH                        equ 0001h
LATJ_LATJ4_MASK                          equ 0010h
LATJ_LATJ5_POSN                          equ 0005h
LATJ_LATJ5_POSITION                      equ 0005h
LATJ_LATJ5_SIZE                          equ 0001h
LATJ_LATJ5_LENGTH                        equ 0001h
LATJ_LATJ5_MASK                          equ 0020h
LATJ_LATJ6_POSN                          equ 0006h
LATJ_LATJ6_POSITION                      equ 0006h
LATJ_LATJ6_SIZE                          equ 0001h
LATJ_LATJ6_LENGTH                        equ 0001h
LATJ_LATJ6_MASK                          equ 0040h
LATJ_LATJ7_POSN                          equ 0007h
LATJ_LATJ7_POSITION                      equ 0007h
LATJ_LATJ7_SIZE                          equ 0001h
LATJ_LATJ7_LENGTH                        equ 0001h
LATJ_LATJ7_MASK                          equ 0080h
LATJ_LJ0_POSN                            equ 0000h
LATJ_LJ0_POSITION                        equ 0000h
LATJ_LJ0_SIZE                            equ 0001h
LATJ_LJ0_LENGTH                          equ 0001h
LATJ_LJ0_MASK                            equ 0001h
LATJ_LJ1_POSN                            equ 0001h
LATJ_LJ1_POSITION                        equ 0001h
LATJ_LJ1_SIZE                            equ 0001h
LATJ_LJ1_LENGTH                          equ 0001h
LATJ_LJ1_MASK                            equ 0002h
LATJ_LJ2_POSN                            equ 0002h
LATJ_LJ2_POSITION                        equ 0002h
LATJ_LJ2_SIZE                            equ 0001h
LATJ_LJ2_LENGTH                          equ 0001h
LATJ_LJ2_MASK                            equ 0004h
LATJ_LJ3_POSN                            equ 0003h
LATJ_LJ3_POSITION                        equ 0003h
LATJ_LJ3_SIZE                            equ 0001h
LATJ_LJ3_LENGTH                          equ 0001h
LATJ_LJ3_MASK                            equ 0008h
LATJ_LJ4_POSN                            equ 0004h
LATJ_LJ4_POSITION                        equ 0004h
LATJ_LJ4_SIZE                            equ 0001h
LATJ_LJ4_LENGTH                          equ 0001h
LATJ_LJ4_MASK                            equ 0010h
LATJ_LJ5_POSN                            equ 0005h
LATJ_LJ5_POSITION                        equ 0005h
LATJ_LJ5_SIZE                            equ 0001h
LATJ_LJ5_LENGTH                          equ 0001h
LATJ_LJ5_MASK                            equ 0020h
LATJ_LJ6_POSN                            equ 0006h
LATJ_LJ6_POSITION                        equ 0006h
LATJ_LJ6_SIZE                            equ 0001h
LATJ_LJ6_LENGTH                          equ 0001h
LATJ_LJ6_MASK                            equ 0040h
LATJ_LJ7_POSN                            equ 0007h
LATJ_LJ7_POSITION                        equ 0007h
LATJ_LJ7_SIZE                            equ 0001h
LATJ_LJ7_LENGTH                          equ 0001h
LATJ_LJ7_MASK                            equ 0080h

// Register: TRISA
#define TRISA TRISA
TRISA                                    equ 0F92h
// bitfield definitions
TRISA_TRISA0_POSN                        equ 0000h
TRISA_TRISA0_POSITION                    equ 0000h
TRISA_TRISA0_SIZE                        equ 0001h
TRISA_TRISA0_LENGTH                      equ 0001h
TRISA_TRISA0_MASK                        equ 0001h
TRISA_TRISA1_POSN                        equ 0001h
TRISA_TRISA1_POSITION                    equ 0001h
TRISA_TRISA1_SIZE                        equ 0001h
TRISA_TRISA1_LENGTH                      equ 0001h
TRISA_TRISA1_MASK                        equ 0002h
TRISA_TRISA2_POSN                        equ 0002h
TRISA_TRISA2_POSITION                    equ 0002h
TRISA_TRISA2_SIZE                        equ 0001h
TRISA_TRISA2_LENGTH                      equ 0001h
TRISA_TRISA2_MASK                        equ 0004h
TRISA_TRISA3_POSN                        equ 0003h
TRISA_TRISA3_POSITION                    equ 0003h
TRISA_TRISA3_SIZE                        equ 0001h
TRISA_TRISA3_LENGTH                      equ 0001h
TRISA_TRISA3_MASK                        equ 0008h
TRISA_TRISA4_POSN                        equ 0004h
TRISA_TRISA4_POSITION                    equ 0004h
TRISA_TRISA4_SIZE                        equ 0001h
TRISA_TRISA4_LENGTH                      equ 0001h
TRISA_TRISA4_MASK                        equ 0010h
TRISA_TRISA5_POSN                        equ 0005h
TRISA_TRISA5_POSITION                    equ 0005h
TRISA_TRISA5_SIZE                        equ 0001h
TRISA_TRISA5_LENGTH                      equ 0001h
TRISA_TRISA5_MASK                        equ 0020h
TRISA_TRISA6_POSN                        equ 0006h
TRISA_TRISA6_POSITION                    equ 0006h
TRISA_TRISA6_SIZE                        equ 0001h
TRISA_TRISA6_LENGTH                      equ 0001h
TRISA_TRISA6_MASK                        equ 0040h
TRISA_TRISA7_POSN                        equ 0007h
TRISA_TRISA7_POSITION                    equ 0007h
TRISA_TRISA7_SIZE                        equ 0001h
TRISA_TRISA7_LENGTH                      equ 0001h
TRISA_TRISA7_MASK                        equ 0080h
TRISA_RA0_POSN                           equ 0000h
TRISA_RA0_POSITION                       equ 0000h
TRISA_RA0_SIZE                           equ 0001h
TRISA_RA0_LENGTH                         equ 0001h
TRISA_RA0_MASK                           equ 0001h
TRISA_RA1_POSN                           equ 0001h
TRISA_RA1_POSITION                       equ 0001h
TRISA_RA1_SIZE                           equ 0001h
TRISA_RA1_LENGTH                         equ 0001h
TRISA_RA1_MASK                           equ 0002h
TRISA_RA2_POSN                           equ 0002h
TRISA_RA2_POSITION                       equ 0002h
TRISA_RA2_SIZE                           equ 0001h
TRISA_RA2_LENGTH                         equ 0001h
TRISA_RA2_MASK                           equ 0004h
TRISA_RA3_POSN                           equ 0003h
TRISA_RA3_POSITION                       equ 0003h
TRISA_RA3_SIZE                           equ 0001h
TRISA_RA3_LENGTH                         equ 0001h
TRISA_RA3_MASK                           equ 0008h
TRISA_RA4_POSN                           equ 0004h
TRISA_RA4_POSITION                       equ 0004h
TRISA_RA4_SIZE                           equ 0001h
TRISA_RA4_LENGTH                         equ 0001h
TRISA_RA4_MASK                           equ 0010h
TRISA_RA5_POSN                           equ 0005h
TRISA_RA5_POSITION                       equ 0005h
TRISA_RA5_SIZE                           equ 0001h
TRISA_RA5_LENGTH                         equ 0001h
TRISA_RA5_MASK                           equ 0020h
TRISA_RA6_POSN                           equ 0006h
TRISA_RA6_POSITION                       equ 0006h
TRISA_RA6_SIZE                           equ 0001h
TRISA_RA6_LENGTH                         equ 0001h
TRISA_RA6_MASK                           equ 0040h
TRISA_RA7_POSN                           equ 0007h
TRISA_RA7_POSITION                       equ 0007h
TRISA_RA7_SIZE                           equ 0001h
TRISA_RA7_LENGTH                         equ 0001h
TRISA_RA7_MASK                           equ 0080h

// Register: TRISB
#define TRISB TRISB
TRISB                                    equ 0F93h
// bitfield definitions
TRISB_TRISB0_POSN                        equ 0000h
TRISB_TRISB0_POSITION                    equ 0000h
TRISB_TRISB0_SIZE                        equ 0001h
TRISB_TRISB0_LENGTH                      equ 0001h
TRISB_TRISB0_MASK                        equ 0001h
TRISB_TRISB1_POSN                        equ 0001h
TRISB_TRISB1_POSITION                    equ 0001h
TRISB_TRISB1_SIZE                        equ 0001h
TRISB_TRISB1_LENGTH                      equ 0001h
TRISB_TRISB1_MASK                        equ 0002h
TRISB_TRISB2_POSN                        equ 0002h
TRISB_TRISB2_POSITION                    equ 0002h
TRISB_TRISB2_SIZE                        equ 0001h
TRISB_TRISB2_LENGTH                      equ 0001h
TRISB_TRISB2_MASK                        equ 0004h
TRISB_TRISB3_POSN                        equ 0003h
TRISB_TRISB3_POSITION                    equ 0003h
TRISB_TRISB3_SIZE                        equ 0001h
TRISB_TRISB3_LENGTH                      equ 0001h
TRISB_TRISB3_MASK                        equ 0008h
TRISB_TRISB4_POSN                        equ 0004h
TRISB_TRISB4_POSITION                    equ 0004h
TRISB_TRISB4_SIZE                        equ 0001h
TRISB_TRISB4_LENGTH                      equ 0001h
TRISB_TRISB4_MASK                        equ 0010h
TRISB_TRISB5_POSN                        equ 0005h
TRISB_TRISB5_POSITION                    equ 0005h
TRISB_TRISB5_SIZE                        equ 0001h
TRISB_TRISB5_LENGTH                      equ 0001h
TRISB_TRISB5_MASK                        equ 0020h
TRISB_TRISB6_POSN                        equ 0006h
TRISB_TRISB6_POSITION                    equ 0006h
TRISB_TRISB6_SIZE                        equ 0001h
TRISB_TRISB6_LENGTH                      equ 0001h
TRISB_TRISB6_MASK                        equ 0040h
TRISB_TRISB7_POSN                        equ 0007h
TRISB_TRISB7_POSITION                    equ 0007h
TRISB_TRISB7_SIZE                        equ 0001h
TRISB_TRISB7_LENGTH                      equ 0001h
TRISB_TRISB7_MASK                        equ 0080h
TRISB_RB0_POSN                           equ 0000h
TRISB_RB0_POSITION                       equ 0000h
TRISB_RB0_SIZE                           equ 0001h
TRISB_RB0_LENGTH                         equ 0001h
TRISB_RB0_MASK                           equ 0001h
TRISB_RB1_POSN                           equ 0001h
TRISB_RB1_POSITION                       equ 0001h
TRISB_RB1_SIZE                           equ 0001h
TRISB_RB1_LENGTH                         equ 0001h
TRISB_RB1_MASK                           equ 0002h
TRISB_RB2_POSN                           equ 0002h
TRISB_RB2_POSITION                       equ 0002h
TRISB_RB2_SIZE                           equ 0001h
TRISB_RB2_LENGTH                         equ 0001h
TRISB_RB2_MASK                           equ 0004h
TRISB_RB3_POSN                           equ 0003h
TRISB_RB3_POSITION                       equ 0003h
TRISB_RB3_SIZE                           equ 0001h
TRISB_RB3_LENGTH                         equ 0001h
TRISB_RB3_MASK                           equ 0008h
TRISB_RB4_POSN                           equ 0004h
TRISB_RB4_POSITION                       equ 0004h
TRISB_RB4_SIZE                           equ 0001h
TRISB_RB4_LENGTH                         equ 0001h
TRISB_RB4_MASK                           equ 0010h
TRISB_RB5_POSN                           equ 0005h
TRISB_RB5_POSITION                       equ 0005h
TRISB_RB5_SIZE                           equ 0001h
TRISB_RB5_LENGTH                         equ 0001h
TRISB_RB5_MASK                           equ 0020h
TRISB_RB6_POSN                           equ 0006h
TRISB_RB6_POSITION                       equ 0006h
TRISB_RB6_SIZE                           equ 0001h
TRISB_RB6_LENGTH                         equ 0001h
TRISB_RB6_MASK                           equ 0040h
TRISB_RB7_POSN                           equ 0007h
TRISB_RB7_POSITION                       equ 0007h
TRISB_RB7_SIZE                           equ 0001h
TRISB_RB7_LENGTH                         equ 0001h
TRISB_RB7_MASK                           equ 0080h

// Register: TRISC
#define TRISC TRISC
TRISC                                    equ 0F94h
// bitfield definitions
TRISC_TRISC0_POSN                        equ 0000h
TRISC_TRISC0_POSITION                    equ 0000h
TRISC_TRISC0_SIZE                        equ 0001h
TRISC_TRISC0_LENGTH                      equ 0001h
TRISC_TRISC0_MASK                        equ 0001h
TRISC_TRISC1_POSN                        equ 0001h
TRISC_TRISC1_POSITION                    equ 0001h
TRISC_TRISC1_SIZE                        equ 0001h
TRISC_TRISC1_LENGTH                      equ 0001h
TRISC_TRISC1_MASK                        equ 0002h
TRISC_TRISC2_POSN                        equ 0002h
TRISC_TRISC2_POSITION                    equ 0002h
TRISC_TRISC2_SIZE                        equ 0001h
TRISC_TRISC2_LENGTH                      equ 0001h
TRISC_TRISC2_MASK                        equ 0004h
TRISC_TRISC3_POSN                        equ 0003h
TRISC_TRISC3_POSITION                    equ 0003h
TRISC_TRISC3_SIZE                        equ 0001h
TRISC_TRISC3_LENGTH                      equ 0001h
TRISC_TRISC3_MASK                        equ 0008h
TRISC_TRISC4_POSN                        equ 0004h
TRISC_TRISC4_POSITION                    equ 0004h
TRISC_TRISC4_SIZE                        equ 0001h
TRISC_TRISC4_LENGTH                      equ 0001h
TRISC_TRISC4_MASK                        equ 0010h
TRISC_TRISC5_POSN                        equ 0005h
TRISC_TRISC5_POSITION                    equ 0005h
TRISC_TRISC5_SIZE                        equ 0001h
TRISC_TRISC5_LENGTH                      equ 0001h
TRISC_TRISC5_MASK                        equ 0020h
TRISC_TRISC6_POSN                        equ 0006h
TRISC_TRISC6_POSITION                    equ 0006h
TRISC_TRISC6_SIZE                        equ 0001h
TRISC_TRISC6_LENGTH                      equ 0001h
TRISC_TRISC6_MASK                        equ 0040h
TRISC_TRISC7_POSN                        equ 0007h
TRISC_TRISC7_POSITION                    equ 0007h
TRISC_TRISC7_SIZE                        equ 0001h
TRISC_TRISC7_LENGTH                      equ 0001h
TRISC_TRISC7_MASK                        equ 0080h
TRISC_RC0_POSN                           equ 0000h
TRISC_RC0_POSITION                       equ 0000h
TRISC_RC0_SIZE                           equ 0001h
TRISC_RC0_LENGTH                         equ 0001h
TRISC_RC0_MASK                           equ 0001h
TRISC_RC1_POSN                           equ 0001h
TRISC_RC1_POSITION                       equ 0001h
TRISC_RC1_SIZE                           equ 0001h
TRISC_RC1_LENGTH                         equ 0001h
TRISC_RC1_MASK                           equ 0002h
TRISC_RC2_POSN                           equ 0002h
TRISC_RC2_POSITION                       equ 0002h
TRISC_RC2_SIZE                           equ 0001h
TRISC_RC2_LENGTH                         equ 0001h
TRISC_RC2_MASK                           equ 0004h
TRISC_RC3_POSN                           equ 0003h
TRISC_RC3_POSITION                       equ 0003h
TRISC_RC3_SIZE                           equ 0001h
TRISC_RC3_LENGTH                         equ 0001h
TRISC_RC3_MASK                           equ 0008h
TRISC_RC4_POSN                           equ 0004h
TRISC_RC4_POSITION                       equ 0004h
TRISC_RC4_SIZE                           equ 0001h
TRISC_RC4_LENGTH                         equ 0001h
TRISC_RC4_MASK                           equ 0010h
TRISC_RC5_POSN                           equ 0005h
TRISC_RC5_POSITION                       equ 0005h
TRISC_RC5_SIZE                           equ 0001h
TRISC_RC5_LENGTH                         equ 0001h
TRISC_RC5_MASK                           equ 0020h
TRISC_RC6_POSN                           equ 0006h
TRISC_RC6_POSITION                       equ 0006h
TRISC_RC6_SIZE                           equ 0001h
TRISC_RC6_LENGTH                         equ 0001h
TRISC_RC6_MASK                           equ 0040h
TRISC_RC7_POSN                           equ 0007h
TRISC_RC7_POSITION                       equ 0007h
TRISC_RC7_SIZE                           equ 0001h
TRISC_RC7_LENGTH                         equ 0001h
TRISC_RC7_MASK                           equ 0080h

